app/Controllers/CustomerController.php

SELECT *
FROM `customer`
---
    public function test()
    {
        $data = $this->customer->findAll();

SELECT *
FROM `customer`
WHERE `customer`.`id` = '5'
---
    public function get($id){
        try {
            $data = $this->customer->find($id);